{
  "dishes": [
    {
      "id": 0,
      "name": "Truffle-Infused Wagyu Beef Carpaccio",
      "image": "https://images.unsplash.com/photo-1546833999-b9f581a1996d?w=800&h=600&fit=crop",
      "category": "appetizer",
      "label": "Chef's Special",
      "price": "24.99",
      "featured": true,
      "description": "An exquisite presentation of paper-thin Wagyu beef slices, delicately drizzled with aged balsamic reduction, shaved black truffles, and micro-arugula. Served with a quail egg yolk and aged Parmigiano-Reggiano. A symphony of umami flavors that dance on the palate."
    },
    {
      "id": 1,
      "name": "Pan-Seared Sea Scallops with Saffron Risotto",
      "image": "https://images.unsplash.com/photo-1565557623262-b51c2513a641?w=800&h=600&fit=crop",
      "category": "mains",
      "label": "Signature",
      "price": "38.99",
      "featured": false,
      "description": "Perfectly caramelized diver scallops served atop creamy saffron-infused Arborio rice risotto. Accompanied by roasted baby vegetables and finished with a velvety lobster reduction sauce. Each scallop is hand-selected for its sweetness and tenderness."
    },

    {
      "id": 3,
      "name": "Chocolate Soufflé with Grand Marnier",
      "image": "https://images.unsplash.com/photo-1565958011703-44f9829ba187?w=800&h=600&fit=crop",
      "category": "dessert",
      "label": "Artisanal",
      "price": "16.99",
      "featured": false,
      "description": "A masterfully crafted chocolate soufflé, light as air yet rich in flavor. Infused with Grand Marnier liqueur and served with a molten chocolate center. Accompanied by house-made vanilla bean ice cream and fresh berries. A dessert that elevates the dining experience to new heights."
    },
    {
      "id": 4,
      "name": "Lobster Bisque with Cognac",
      "image": "https://images.unsplash.com/photo-1547592166-23ac45744acd?w=800&h=600&fit=crop",
      "category": "appetizer",
      "label": "Classic",
      "price": "18.99",
      "featured": false,
      "description": "Velvety smooth lobster bisque enriched with cognac and finished with a touch of crème fraîche. Made from the finest Maine lobster shells and served with a delicate puff pastry crown. A soup that captures the essence of the sea."
    },
    {
      "id": 5,
      "name": "Rack of Colorado Lamb with Rosemary Jus",
      "image": "https://images.unsplash.com/photo-1544025162-d76694265947?w=800&h=600&fit=crop",
      "category": "mains",
      "label": "Premium",
      "price": "48.99",
      "featured": true,
      "description": "Herb-crusted rack of Colorado lamb, cooked to perfect medium-rare and served with a rich rosemary-infused jus. Accompanied by roasted root vegetables and creamy polenta. The lamb is sourced from sustainable farms and aged for optimal tenderness."
    },

    {
      "id": 7,
      "name": "Crème Brûlée with Madagascar Vanilla",
      "image": "https://images.unsplash.com/photo-1551024506-0bccd828d307?w=800&h=600&fit=crop",
      "category": "dessert",
      "label": "Traditional",
      "price": "14.99",
      "featured": false,
      "description": "Classic French crème brûlée made with Madagascar vanilla beans and organic cream. Topped with a perfectly caramelized sugar crust that shatters with each spoonful. Served with fresh seasonal berries and a delicate tuile cookie."
    }
  ],
  "comments": [
    {
      "id": 0,
      "dishId": 0,
      "rating": 5,
      "comment": "The Wagyu carpaccio was absolutely transcendent. The truffle infusion elevated this dish to a level I've never experienced before. The texture and flavor balance were perfect.",
      "author": "Marcus Chen",
      "date": "2024-01-15T19:30:28.556094Z"
    },
    {
      "id": 1,
      "dishId": 0,
      "rating": 5,
      "comment": "An exceptional dining experience. The quality of the Wagyu and the precision of the preparation showcase true culinary artistry. Worth every penny.",
      "author": "Isabella Rodriguez",
      "date": "2024-01-14T20:15:28.556094Z"
    },
    {
      "id": 2,
      "dishId": 0,
      "rating": 4,
      "comment": "Beautiful presentation and excellent flavors. The truffle was perfectly balanced - not overwhelming but definitely present. Would definitely order again.",
      "author": "David Thompson",
      "date": "2024-01-13T18:45:28.556094Z"
    },
    {
      "id": 3,
      "dishId": 1,
      "rating": 5,
      "comment": "The scallops were perfectly seared with a beautiful golden crust. The saffron risotto was creamy and flavorful. This dish represents fine dining at its best.",
      "author": "Sophie Laurent",
      "date": "2024-01-12T21:20:28.556094Z"
    },
    {
      "id": 4,
      "dishId": 1,
      "rating": 5,
      "comment": "Absolutely divine! The scallops melted in my mouth and the risotto was perfectly al dente. The lobster reduction added incredible depth of flavor.",
      "author": "James Wilson",
      "date": "2024-01-11T19:10:28.556094Z"
    },
    {
      "id": 5,
      "dishId": 2,
      "rating": 5,
      "comment": "The duck confit was everything I hoped for and more. Tender, flavorful, and the cherry port reduction was the perfect accompaniment. A truly memorable dish.",
      "author": "Marie Dubois",
      "date": "2024-01-10T20:30:28.556094Z"
    },
    {
      "id": 6,
      "dishId": 2,
      "rating": 4,
      "comment": "Excellent traditional preparation. The duck was perfectly cooked and the sauce was rich without being heavy. Very authentic French bistro experience.",
      "author": "Pierre Moreau",
      "date": "2024-01-09T18:55:28.556094Z"
    },
    {
      "id": 7,
      "dishId": 3,
      "rating": 5,
      "comment": "The chocolate soufflé was a work of art! Light, airy, and the Grand Marnier added a sophisticated touch. The molten center was perfectly timed.",
      "author": "Emma Davis",
      "date": "2024-01-08T21:45:28.556094Z"
    },
    {
      "id": 8,
      "dishId": 3,
      "rating": 5,
      "comment": "Spectacular dessert! The soufflé rose beautifully and the chocolate flavor was intense yet balanced. A perfect ending to an exceptional meal.",
      "author": "Robert Anderson",
      "date": "2024-01-07T20:15:28.556094Z"
    },
    {
      "id": 9,
      "dishId": 4,
      "rating": 4,
      "comment": "Rich and flavorful lobster bisque. The cognac added a nice depth and the puff pastry crown was a lovely touch. Very satisfying starter.",
      "author": "Sarah Johnson",
      "date": "2024-01-06T19:20:28.556094Z"
    },
    {
      "id": 10,
      "dishId": 5,
      "rating": 5,
      "comment": "The Colorado lamb was exceptional - tender, flavorful, and perfectly cooked. The rosemary jus was the perfect complement. A truly premium dining experience.",
      "author": "Michael Brown",
      "date": "2024-01-05T20:40:28.556094Z"
    },
    {
      "id": 11,
      "dishId": 6,
      "rating": 5,
      "comment": "As a vegetarian, I was blown away by this dish. The wild mushrooms were incredibly flavorful and the truffle cream sauce was luxurious. Even meat-eaters would love this!",
      "author": "Lisa Green",
      "date": "2024-01-04T18:30:28.556094Z"
    },
    {
      "id": 12,
      "dishId": 7,
      "rating": 4,
      "comment": "Classic crème brûlée executed perfectly. The vanilla flavor was prominent and the sugar crust was perfectly caramelized. A timeless dessert done right.",
      "author": "Thomas White",
      "date": "2024-01-03T21:10:28.556094Z"
    },
    {
      "id": 13,
      "dishId": 0,
      "rating": 5,
      "comment": "This Wagyu carpaccio is a masterpiece! The truffle shavings add such depth and the presentation is absolutely stunning. Worth every penny for this level of quality.",
      "author": "Jennifer Park",
      "date": "2024-01-02T20:45:28.556094Z"
    },
    {
      "id": 14,
      "dishId": 1,
      "rating": 4,
      "comment": "The scallops were perfectly cooked with a beautiful sear. The saffron risotto was creamy and flavorful. A very satisfying main course.",
      "author": "Carlos Mendez",
      "date": "2024-01-01T19:30:28.556094Z"
    },
    {
      "id": 15,
      "dishId": 2,
      "rating": 5,
      "comment": "Incredible duck confit! The meat was so tender it fell off the bone. The cherry port reduction was the perfect sweet complement to the rich duck.",
      "author": "Amanda Foster",
      "date": "2023-12-31T21:15:28.556094Z"
    },
    {
      "id": 16,
      "dishId": 3,
      "rating": 5,
      "comment": "The chocolate soufflé was absolutely divine! Light and airy with a rich chocolate flavor. The Grand Marnier added a sophisticated touch.",
      "author": "Daniel Kim",
      "date": "2023-12-30T22:00:28.556094Z"
    },
    {
      "id": 17,
      "dishId": 4,
      "rating": 5,
      "comment": "The lobster bisque was rich and flavorful. The cognac added a nice depth and the puff pastry crown was a lovely touch. Perfect starter!",
      "author": "Rachel Green",
      "date": "2023-12-29T20:20:28.556094Z"
    },
    {
      "id": 18,
      "dishId": 5,
      "rating": 5,
      "comment": "The Colorado lamb was exceptional! Perfectly cooked medium-rare with amazing flavor. The rosemary jus was the perfect accompaniment.",
      "author": "Steven Taylor",
      "date": "2023-12-28T19:45:28.556094Z"
    },
    {
      "id": 19,
      "dishId": 6,
      "rating": 4,
      "comment": "As a vegetarian, I was impressed by this dish. The wild mushrooms were flavorful and the truffle cream sauce was luxurious. Great option!",
      "author": "Michelle Wong",
      "date": "2023-12-27T18:30:28.556094Z"
    },
    {
      "id": 20,
      "dishId": 7,
      "rating": 5,
      "comment": "Perfect crème brûlée! The vanilla flavor was prominent and the sugar crust was perfectly caramelized. A classic done right.",
      "author": "Kevin Johnson",
      "date": "2023-12-26T21:00:28.556094Z"
    },
    {
      "id": 21,
      "dishId": 0,
      "rating": 4,
      "comment": "Beautiful presentation and excellent flavors. The truffle was perfectly balanced and the Wagyu quality was outstanding.",
      "author": "Nicole Brown",
      "date": "2023-12-25T20:30:28.556094Z"
    },
    {
      "id": 22,
      "dishId": 1,
      "rating": 5,
      "comment": "The scallops were perfectly seared and the risotto was creamy and flavorful. This dish represents fine dining at its best!",
      "author": "Alex Rivera",
      "date": "2023-12-24T19:15:28.556094Z"
    },
    {
      "id": 23,
      "dishId": 2,
      "rating": 4,
      "comment": "Excellent traditional preparation of duck confit. The meat was tender and the sauce was rich without being heavy.",
      "author": "Samantha Lee",
      "date": "2023-12-23T20:45:28.556094Z"
    },
    {
      "id": 24,
      "dishId": 3,
      "rating": 5,
      "comment": "The chocolate soufflé was a work of art! Light, airy, and the Grand Marnier added a sophisticated touch. Perfect ending!",
      "author": "Brandon Wilson",
      "date": "2023-12-22T21:30:28.556094Z"
    },
    {
      "id": 25,
      "dishId": 4,
      "rating": 4,
      "comment": "Rich and flavorful lobster bisque. The cognac added nice depth and the presentation was elegant. Very satisfying.",
      "author": "Christina Davis",
      "date": "2023-12-21T18:45:28.556094Z"
    }
  ],
  "promotions": [
    {
      "id": 0,
      "name": "Chef's Tasting Menu Experience",
      "image": "https://images.unsplash.com/photo-1414235077428-338989a2e8c0?w=800&h=600&fit=crop",
      "label": "Exclusive",
      "price": "125.00",
      "featured": true,
      "description": "An extraordinary culinary journey featuring seven courses personally curated by our Executive Chef. Each dish showcases seasonal ingredients and innovative techniques. Includes wine pairings selected by our sommelier. Available for dinner service only. Reservations required 48 hours in advance. A dining experience that transcends the ordinary and enters the realm of culinary artistry."
    }
  ],
  "leaders": [
    {
      "id": 0,
      "name": "Chef Alessandro Rossi",
      "image": "https://images.unsplash.com/photo-1577219491135-ce391730fb2c?w=400&h=400&fit=crop",
      "designation": "Executive Chef & Culinary Director",
      "abbr": "EC",
      "featured": true,
      "description": "Chef Alessandro Rossi brings over two decades of culinary excellence to our kitchen. A graduate of Le Cordon Bleu in Paris, he has worked alongside culinary legends including Alain Ducasse and Gordon Ramsay. His philosophy centers on respecting traditional techniques while embracing modern innovation. Chef Rossi's signature style combines classical French foundations with contemporary global influences, creating dishes that are both timeless and cutting-edge. Under his leadership, our restaurant has earned three Michelin stars and numerous international accolades."
    },
    {
      "id": 1,
      "name": "Isabella Martinez",
      "image": "https://images.unsplash.com/photo-1438761681033-6461ffad8d80?w=400&h=400&fit=crop",
      "designation": "Director of Operations",
      "abbr": "DO",
      "featured": false,
      "description": "Isabella Martinez oversees all aspects of restaurant operations with precision and grace. With an MBA from Harvard Business School and 15 years in luxury hospitality, she ensures that every detail of the guest experience exceeds expectations. Her expertise in service excellence and operational efficiency has been instrumental in maintaining our reputation as one of the city's premier dining destinations."
    },
    {
      "id": 2,
      "name": "Marcus Chen",
      "image": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=400&h=400&fit=crop",
      "designation": "Head Sommelier",
      "abbr": "HS",
      "featured": false,
      "description": "Marcus Chen curates our extensive wine program, featuring over 1,200 carefully selected bottles from the world's most prestigious vineyards. A certified Master Sommelier, he has an unparalleled knowledge of wine regions, vintages, and food pairings. His passion for discovering exceptional wines and his ability to create perfect pairings enhances every dining experience, making each meal a complete sensory journey."
    }
  ],
  "feedback": [
    {
      "firstname": "John",
      "lastname": "Smith",
      "telnum": "555-0123",
      "email": "john.smith@email.com",
      "agree": true,
      "contactType": "Email",
      "message": "The dining experience was absolutely exceptional. The service was impeccable, the food was outstanding, and the atmosphere was perfect for our anniversary celebration. We will definitely be returning and recommending to friends.",
      "date": "2024-01-15T14:30:49.890Z",
      "id": 1
    }
  ]
}